Documents/Игра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Игра</Name>
			<BasedOn>
				<xr:Item>Catalog.Соревнование</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соперник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РейтингСоперника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соревнования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Соревнование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетИгрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСоперник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Выгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Выгрузка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Соревнование</v8:Type>
						<v8:Type>cfg:DocumentRef.Игра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Игра/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Соревнования = ДанныеЗаполнения.Ссылка;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Партии.Количество() > 0 Тогда 
		//пишем в базу
		//шапка параметрами, ТЧ сворачиваем в строку
		шапка = Новый Структура;
		шапка.Вставить("Соперник", Соперник);
		шапка.Вставить("РейтингСоперника", РейтингСоперника);
		шапка.Вставить("Результат", Результат);
		шапка.Вставить("Счет", Счет);
		шапка.Вставить("Пользователь", СТРОКА(Константы.ГУИД.Получить()));
		
		//ТЧ
		ср = Новый СериализаторXDTO(ФабрикаXDTO);
		об = ср.ЗаписатьXDTO(ПолучитьТаблицу());
		зп = Новый ЗаписьXML;
		зп.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(зп, об);
		стрТаб = зп.Закрыть();
		
		//шапку в строку
		обШапка = ср.ЗаписатьXDTO(шапка);
		зп = Новый ЗаписьXML;
		зп.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(зп, обШапка);
		стрШпк = зп.Закрыть();
		
		срв = Соревнования.Ссылка.УИД;
		
		сервис = WSСсылки.WSTenis.СоздатьWSПрокси("WSTenis", "WSTenis", "WSTenisSoap12");
		Если НЕ ЗначениеЗаполнено(УИД) Тогда 
			Попытка
				УИД = Новый УникальныйИдентификатор(сервис.AddGame(СТРОКА(срв), стрШпк, стрТаб));
			Исключение
				мз = РегистрыСведений.Выгрузка.СоздатьМенеджерЗаписи();
				мз.ОбъектВыгрузки = Ссылка;
				мз.Записать();
			КонецПопытки;
		Иначе
			Попытка
				рез = сервис.UpdateGame(СТРОКА(срв), стрШпк, стрТаб, СТРОКА(УИД));
			Исключение
				мз = РегистрыСведений.Выгрузка.СоздатьМенеджерЗаписи();
				мз.ОбъектВыгрузки = Ссылка;
				мз.Записать();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИграПартии.СчетИгрок КАК СчетИгрок,
	|	ИграПартии.СчетСоперник КАК СчетСоперник,
	|	ИграПартии.Итог КАК Итог
	|ИЗ
	|	Документ.Игра.Партии КАК ИграПартии
	|ГДЕ
	|	ИграПартии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
/////////////////////////////////////////////////////////
//Функция AddGame(CmptUID, CmptStruct, CmptTable)
//	ср = Новый СериализаторXDTO(ФабрикаXDTO);
//	чт = Новый ЧтениеXML;
//	чт.УстановитьСтроку(CmptStruct);		
//	шапка = ср.ПрочитатьXML(чт);
//	
//	срв = Справочники.Соревнование.ПолучитьСсылку(Новый УникальныйИдентификатор(CmptUID));
//	игр = Документы.Игра.СоздатьДокумент();
//	игр.Дата = ТекущаяДата();
//	игр.Соревнования = срв;
//	
//	//обходим структуру
//	знчСтр = Неопределено;
//	Если шапка.Свойство("Соперник", знчСтр) Тогда
//		игр.Соперник = знчСтр;
//	КонецЕсли;
//	Если шапка.Свойство("РейтингСоперника", знчСтр) Тогда
//		игр.РейтингСоперника = знчСтр;
//	КонецЕсли;
//	Если шапка.Свойство("Результат", знчСтр) Тогда
//		игр.Результат = знчСтр;
//	КонецЕсли;
//	Если шапка.Свойство("Счет", знчСтр) Тогда
//		игр.Счет = знчСтр;
//	КонецЕсли;
//	Если шапка.Свойство("Пользователь", знчСтр) Тогда
//		игр.Пользователь = Новый УникальныйИдентификатор(знчСтр);
//	КонецЕсли;
//	
//	игр.Записать(РежимЗаписиДокумента.Запись);
//	Возврат СТРОКА(игр.Ссылка.УникальныйИдентификатор());
//КонецФункции
